{"maxKnights":1,"requiredLevels":[],"isTutorial":true,"turnsToStars":[10,9],"reruns":2,"ai":["int i = randInt(1,2);","Skeleton skelly = new Skeleton(EAST,i);"],"id":5,"tutorialEntries":["Another thing you will need upon your way to become a master of Java are \"Conditional Statements\". These consist of the following magical formulas:","if ( <condition> ) {\n\t<consequent>\n}\nelse {\n\t<alternative>\n}","Note that the '<' and '>' characters are never part of the code! Instead they symbolize a placeholder for what you are supposed to write here!","A <condition> is something that is either true or false. You can actually enter \"true\" or \"false\" to test this kind of statements and see what happens. For our purposes we want to test, whether a cell contains a Skeleton or not.","To do this write:\n\"if(<knight name>.targetsEntity(SKELETON)) {\"\nand then press Enter.\nA '}' will be added automatically!","If you haven't found out already: the Skeleton will appear at a random spawn point. The statement \"int i\" declares a new Variable that has a whole number as value. \"= randInt(1,2);\" means the value will be a whole number between 1 and 2.","Therefore the resulting value of \"i\" will either be 1 or 2.\n1 will spawn the Skeleton at the upper spawn, 2 will spawn it at the lower one.\nTo ensure you dont rely on luck this Level will be executed twice with different values of i!","You can now enter what it is you want to happen, if there is a Skeleton in front of you (I would turn around in this case and take another route). After you have finished what should happen in this case, you can specify what should happen if there is no Skeleton.","To do that write below the '}' of the if-Statement (create a new Codefield by pressing enter after selecting the '}'):\nelse {","When you are done if the else part you can test your code. Be reminded that every thing you learn here is automatically added to your spellbook!","Also note that there is the possibility to write an else-if-Statement like this:\n\telse if (<condition>) {\nTo differentiate between different possible alternatives!"],"map":[["empty","empty","wall","wall","wall","wall","wall"],["wall","wall","wall",{"id":1,"content":"enemy_spawn"},"path","exit","wall"],["wall","spawn",{"item":"key","content":"path"},"path","wall","wall","wall"],["wall","wall","wall",{"id":2,"content":"enemy_spawn"},"path","exit","wall"],["empty","empty","wall","wall","wall","wall","wall"]],"locToStars":[16,14]}