{"maxKnights":1,"requiredLevels":[],"isTutorial":true,"turnsToStars":[15,13],"ai":[],"id":1,"tutorialEntries":["Great! That was your first step towards freedom! Check the spellbook to see what you have unlocked! Also hover your mouse over the colored text for more details.","Also note that your solution for any level will always be rated at the end. Only 2 things are important here: How many turns did your Knight need and how many lines of code did you use. This rating is only there for you to see, if there is a shorter way to solve that level!","Now in order to make your knight face a different DIRECTION at the start, you can pass a DIRECTION as PARAMETER to its CONSTRUCTOR:\n\"Knight lancelot = new Knight(EAST)\"","Actually if you don't want to write as much code, you're better off if you simply name your Knight k. You can rename your Knight by clicking on the Codefield where you declared him and pressing Ctrl-R.","Now there's a few more things your Knights can do than just walking straight and opening doors!","They can also turn towards a different direction and use shovels in order to remove some dirt that is blocking their way.","To do this you must first \"collect()\" the shovel, then call the method \"turn(RIGHT)\" and finally \"useItem()\" to remove the blockage.\nOther options for turn are LEFT or AROUND which you may find in your Spellbook after you have completed the level!","Okay so how do you get around this key with a shovel in your hand? Well in order to do that we must first drop the shovel via \"dropItem()\". But we can only do this if we use \"turn(AROUND)\" first.","Note that you can use the shortcut Alt-Arrow Up or Alt-Arrow Down to move codefields, if you have written them in the wrong order!\nThis will only work if this doesnt produce an error though!"],"map":[["wall","wall","wall","wall","wall"],["wall","spawn","path",{"item":"shovel","content":"path"},"wall"],["wall","wall","wall","dirt","wall"],["empty","empty","wall",{"item":"key","content":"path"},"wall"],["empty","empty","wall","exit","wall"],["empty","empty","wall","wall","wall"]],"locToStars":[15,13]}